charles8051/periphery/src/Periphery.Treehopper/firmware/Treehopper-EFM8/lib/efm8ub1/peripheralDrivers/src/spi_0.c
/******************************************************************************
 * Copyright (c) 2015 by Silicon Laboratories Inc. All rights reserved.
 *
 * http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
 *****************************************************************************/

#include "efm8_config.h"
#include "SI_EFM8UB1_Register_Enums.h"
#include "spi_0.h"

#if EFM8PDL_SPI0_AUTO_PAGE == 1
// declare variable needed for autopage enter/exit
#define DECL_PAGE uint8_t savedPage
// enter autopage section
#define SET_PAGE(p)     do                                                    \
                        {                                                     \
                          savedPage = SFRPAGE;  /* save current SFR page */   \
                          SFRPAGE = (p);        /* set SFR page */            \
                        } while(0)
// exit autopage section
#define RESTORE_PAGE(x) do                                                    \
                        {                                                     \
                          SFRPAGE = savedPage;  /* restore saved SFR page */  \
                        } while(0)
#else
#define DECL_PAGE
#define SET_PAGE(x)
#define RESTORE_PAGE(x)
#endif

// SFR page used to access SPI registers
#define SPI_SFR_PAGE 0x20

// Adaptive masked-window sizing for the USB/SPI lock-up fix.
// SPI0_pollTransfer services the FIFO in chunks with interrupts masked; the masked
// time per chunk is ~ chunk*(SPI0CKR+1) core clocks. We size the chunk from the
// live clock divider so that time stays roughly constant (~<=256us worst case)
// across the whole SPI range (~12 MHz down to ~94 kHz). This keeps USB un-starved
// even at slow SPI -- which is a real need (long/breadboard wiring, slow or
// isolated slaves, bring-up), not just a corner case.
//   chunk = clamp(SPI_MASK_BUDGET / (SPI0CKR + 1), 1, SPI_MASK_CHUNK_MAX)
#define SPI_MASK_CHUNK_MAX 32u   // cap at fast clocks (masked time is small there)
#define SPI_MASK_BUDGET   768u   // chunk*(SPI0CKR+1) budget (~256us at ~48 MHz sysclk)

// Runtime API

// Flag to indicate if driver should control Nss (chip select)
static bool useNss  = false;

// flag to indicate we are in master mode (else slave)
static bool modeIsMaster = false;

// flag to indicate that init vars (above) are valid.  If they are
// not valid then a special one-time init will be called to set them
static bool initIsValid = false;

// ----------------------------------------------------------------------------
// Initialize internal state variables.  This is used if init API is
// not called.
// ----------------------------------------------------------------------------
static void SPI0_internalInit(void)
{
  // figure out if we are master mode, and using 4-wire or not
  modeIsMaster = SPI0CFG & SPI0CFG_MSTEN__MASTER_ENABLED;
  useNss = SPI0CN0 & SPI0CN0_NSSMD__FMASK;

  // indicate that init has now been done
  initIsValid = true;
}

#if (EFM8PDL_SPI0_AUTO_PAGE == 1)
// ----------------------------------------------------------------------------
// Get interrupt flags
// ----------------------------------------------------------------------------
uint8_t SPI0_getIntFlags(void)
{
  uint8_t ret;
  DECL_PAGE;
  SET_PAGE(SPI_SFR_PAGE);
  ret = SPI0CN0 & 0xF0;
  RESTORE_PAGE();
  return ret;
}

// ----------------------------------------------------------------------------
// Clear specific interrupt flags
// ----------------------------------------------------------------------------
void SPI0_clearIntFlags(uint8_t flags)
{
  DECL_PAGE;
  SET_PAGE(SPI_SFR_PAGE);
  SPI0CN0 = (SPI0CN0 & (~flags | 0x0F));
  RESTORE_PAGE();
}
#endif

// ----------------------------------------------------------------------------
// Write a byte if transmit buffer is not full.
// ----------------------------------------------------------------------------
bool SPI0_writeByte(uint8_t value)
{
  bool ret = false;
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);

  // check to see if transmit buffer is not full
  if (SPI0CN0_TXNF)
  {
    SPI0DAT = value;
    ret = true;
  }

  RESTORE_PAGE();
  return ret;
}

// ----------------------------------------------------------------------------
// Write a byte, waiting for transmit buffer to be empty
// ----------------------------------------------------------------------------
void SPI0_pollWriteByte(uint8_t value)
{
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);

  // wait for TX empty
  while (!SPI0CN0_TXNF)
  {}

  SPI0DAT = value;

  RESTORE_PAGE();
}

#if (EFM8PDL_SPI0_AUTO_PAGE == 1)
// ----------------------------------------------------------------------------
// Read a byte without checking status
// ----------------------------------------------------------------------------
extern uint8_t SPI0_readByte(void)
{
  uint8_t ret;
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);
  ret = SPI0DAT;
  RESTORE_PAGE();
  return ret;
}
#endif

// ----------------------------------------------------------------------------
// Read a byte, waiting for ther receive buffer to contain at least one byte.
// ----------------------------------------------------------------------------
uint8_t SPI0_pollReadByte(void)
{
  uint8_t ret;
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);

  // wait while RX is empty
  while (SPI0CFG & SPI0CFG_RXE__BMASK)
  {}

  ret = SPI0DAT;
  RESTORE_PAGE();

  return ret;
}

// ----------------------------------------------------------------------------
// Perform a multi-byte transfer, waiting for each byte to complete.
// ----------------------------------------------------------------------------
uint8_t
SPI0_pollTransfer(SI_VARIABLE_SEGMENT_POINTER(pTxBuffer, uint8_t,
                                              EFM8PDL_SPI0_TX_SEGTYPE),
                  SI_VARIABLE_SEGMENT_POINTER(pRxBuffer, uint8_t,
                                              EFM8PDL_SPI0_RX_SEGTYPE),
                  SPI0_TransferDirection_t dir,
                  uint8_t xferCount)
{
  uint8_t txCount = xferCount;
  bool checkNss = false;
  uint8_t maskChunk;
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);

  // This function is not interrupt driven and if SPI interrupts are
  // enabled, it can cause interference.
  SPI0_disableInt();

  // make sure SPI is not already busy
  while (SPI0CFG & SPI0CFG_SPIBSY__BMASK)
  {}

  // Check to see if run-time mode variables have been set up
  if (!initIsValid)
  {
    SPI0_internalInit();
  }

  // Flush the RX buffer in case something is in there
#if (EFM8PDL_SPI0_AUTO_PAGE == 1)
  {
    // if auto page is enabled then we dont need to change pages here
    SPI0FCN0 |= SPI0FCN0_RFLSH__FLUSH;
  }
#else
  {
    // if auto page is not enabled, then we need to change pages for
    // this section of code
    uint8_t savedPage = SFRPAGE;
    SFRPAGE = SPI_SFR_PAGE;
    SPI0FCN0 |= SPI0FCN0_RFLSH__FLUSH;
    SFRPAGE = savedPage;
  }
#endif

  // assert NSS (if used)
  if (modeIsMaster && useNss)
  {
    SPI0CN0_NSSMD0 = 0;
  }

  // USB/SPI lock-up fix, BOUNDED form. The polled FIFO loop races
  // with the USB ISR: a USB interrupt firing mid-transfer lets the in-flight TX
  // FIFO keep clocking into the 4-deep RX FIFO; on overflow RX bytes are dropped,
  // the xferCount accounting desyncs, and the loop spins forever. We service the
  // transfer in chunks with interrupts masked, capping TX at the chunk size so the
  // SPI is idle at each chunk boundary (nothing in flight) -- so reopening
  // interrupts between chunks can't reopen the overflow, and no drain is needed.
  // The chunk is sized from the live clock divider so the masked window stays
  // bounded across the whole SPI range (see SPI_MASK_BUDGET). Master-mode
  // transfers (all Treehopper SPI) always terminate.
  // Tiered (no 16-bit divide -- that pulled in ~140 B of C51 runtime and blew the
  // flash ceiling): halve the chunk each time the divider (SPI0CKR+1) doubles, so
  // chunk*(SPI0CKR+1) stays <= SPI_MASK_BUDGET (768 -> ~256us). Thresholds are
  // SPI0CKR <= 768/chunk - 1.
  {
    uint8_t ckr = SPI0CKR;                  // SPI clock divider - 1 (SYSCLK/(2*(ckr+1)))
    if      (ckr <= 23u)  maskChunk = 32u;  // >=1 MHz  : full chunk
    else if (ckr <= 47u)  maskChunk = 16u;
    else if (ckr <= 95u)  maskChunk = 8u;
    else if (ckr <= 191u) maskChunk = 4u;
    else                  maskChunk = 2u;   // down to ~94 kHz : 2-byte windows
  }

  while (xferCount)
  {
    uint8_t chunkRx = (xferCount < maskChunk) ? (uint8_t)xferCount : maskChunk;
    uint8_t chunkTx = chunkRx;   // send exactly as many as we read this chunk

    IE_EA = 0;   // mask: this chunk must be serviced un-preempted

    while (chunkRx)
    {
      // Feed TX, but ONLY up to this chunk's quota. Capping TX at chunkRx means
      // no bytes are left in flight when chunkRx hits 0, so the SPI is idle at
      // the unmask below -- without a drain loop (a drain that clocked out
      // in-flight TX without reading RX would overflow the RX FIFO and lose a
      // byte, which is what hung the first cut of this fix).
      if (chunkTx && SPI0CN0_TXNF && txCount)
      {
        if (dir & SPI0_TRANSFER_TX) { SPI0DAT = *pTxBuffer; ++pTxBuffer; }
        else                        { SPI0DAT = 0; }
        --txCount; --chunkTx;
      }

      // Read RX as bytes arrive
      if (!(SPI0CFG & SPI0CFG_RXE__BMASK))
      {
        if (dir & SPI0_TRANSFER_RX) { *pRxBuffer = SPI0DAT; ++pRxBuffer; }
        else                        { uint8_t dummy = SPI0DAT; }
        --xferCount; --chunkRx;
      }

      // Slave 4-wire: bail if the master deselected (no-op in master mode).
      if (!modeIsMaster && useNss)
      {
        if (!checkNss) { if (SPI0CFG & SPI0CFG_SLVSEL__BMASK) checkNss = true; }
        else if (!(SPI0CFG & SPI0CFG_SLVSEL__BMASK)) { xferCount = 0; break; }
      }
    }

