charles8051/periphery/src/Periphery.Treehopper/firmware/Treehopper-EFM8/lib/efm8ub1/peripheralDrivers/src/spi_0.c
    // chunkTx == chunkRx == 0: exactly `chunk` bytes sent and received, so the
    // SPI is idle (nothing in flight) and reopening interrupts here is safe.
    IE_EA = 1;
  }

  // Transfer is done.  Deassert NSS (if used)
  if (modeIsMaster && useNss)
  {
    SPI0CN0_NSSMD0 = 1;
  }

  RESTORE_PAGE();
  return xferCount;
}

// ----------------------------------------------------------------------------
// Check if SPI is busy with a transfer in progress.
// ----------------------------------------------------------------------------
bool SPI0_isBusy(void)
{
  uint8_t count = 0;
  bool ret = false;
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);

  // the SPI busy bit can drop between bytes so you cant just poll
  // it to find out when all the bytes have been transferred.  Or sometimes
  // you will catch it not set, between bytes when it is really still
  // busy.  To make busy test useful, we need to know when it is done
  // with all bytes.  That is why there is a loop below.

  // Read it several times and if the bit is ever marked busy, then
  // return busy indication.
  for (count = 0; count < 3; count++)
  {
    if (SPI0CFG & SPI0CFG_SPIBSY__BMASK)
    {
      ret = true;
    }
  }

  // If it makes it through the loops above without find the busy bit
  // then it is not busy.
  RESTORE_PAGE();
  return ret;
}

#if (EFM8PDL_SPI0_AUTO_PAGE == 1)
// ----------------------------------------------------------------------------
// Check if transmit buffer is full
// ----------------------------------------------------------------------------
bool SPI0_isTxFull(void)
{
  bool ret;
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);
  ret = !SPI0CN0_TXNF;
  RESTORE_PAGE();
  return ret;
}

// ----------------------------------------------------------------------------
// Check if slave is selected
// ----------------------------------------------------------------------------
bool SPI0_isSlaveSelected(void)
{
  bool ret;
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);
  ret = SPI0CFG & SPI0CFG_SLVSEL__BMASK;
  RESTORE_PAGE();
  return ret;
}

// ----------------------------------------------------------------------------
// Check if shift register is empty
// ----------------------------------------------------------------------------
bool SPI0_isShiftEmpty(void)
{
  bool ret;
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);
  ret = SPI0CFG & SPI0CFG_SRMT__BMASK;
  RESTORE_PAGE();
  return ret;
}

// ----------------------------------------------------------------------------
// Check if receive buffer is empty
// ----------------------------------------------------------------------------
bool SPI0_isRxEmpty(void)
{
  bool ret;
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);
  ret = SPI0CFG & SPI0CFG_RXE__BMASK;
  RESTORE_PAGE();
  return ret;
}
#endif

// ----------------------------------------------------------------------------
// Initialize the SPI peripheral operating parameters
// ----------------------------------------------------------------------------
void SPI0_init(SPI0_ClockMode_t clockMode, bool isMasterMode, bool is4wire)
{
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);

  // Figure out if this driver controls NSS signal (chip select)
  modeIsMaster = isMasterMode;
  useNss = is4wire;
  initIsValid = true;

  // disable SPI before configuring
  SPI0CN0_SPIEN = 0;

  // Set up the clock mode (phase and polarity), and the
  // master/slave selection
  SPI0CFG = clockMode | (isMasterMode ? SPI0CFG_MSTEN__MASTER_ENABLED
                                      : SPI0CFG_MSTEN__MASTER_DISABLED);

  // Set up the NSS mode bits depending on whether 3-wire or 4-wire
  // is used, and whether master or slave mode
  if (is4wire)
  {
    SPI0CN0_NSSMD0 = 1;
    SPI0CN0_NSSMD1 = isMasterMode ? 1 : 0;
  }
  else
  {
    SPI0CN0_NSSMD0 = 0;
    SPI0CN0_NSSMD1 = 0;
  }

  // clear all the interrupt bits and enable the SPI
  SPI0CN0 &= ~0xF0;
  SPI0CN0_SPIEN = 1;

  RESTORE_PAGE();
}

// ----------------------------------------------------------------------------
// Set the clock divider used to determine SPI clock rate
// ----------------------------------------------------------------------------
void SPI0_setClockDivider(uint16_t divider)
{
  DECL_PAGE;

  // constrain input in case user passes a bad value
  if (divider > 512)
  {
    divider = 512;
  }
  if (divider < 2)
  {
    divider = 2;
  }
  // make even value
  divider &= ~1;

  // Transform the divider to the form needed by SFR.
  // See equation in the data sheet for more information
  divider /= 2;
  divider -= 1;

  // disable SPI before configuring, then update the value
  SET_PAGE(SPI_SFR_PAGE);
  SPI0CN0_SPIEN = 0;
  SPI0CKR = (uint8_t)divider;
  SPI0CN0_SPIEN = 1;
  RESTORE_PAGE();
}

#if (EFM8PDL_SPI0_AUTO_PAGE == 1)
// ----------------------------------------------------------------------------
// Reset SPI to disabled state.
// ----------------------------------------------------------------------------
void SPI0_reset(void)
{
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);
  SPI0CN0 &= 0x0E;
  IE_ESPI0 = 0;
  RESTORE_PAGE();
}
#endif

// ----------------------------------------------------------------------------
// Read status of TFRQ
// ----------------------------------------------------------------------------
bool SPI0_isFifoTxReq(void)
{
  bool ret = false;
  uint8_t savedPage = SFRPAGE;
  SFRPAGE = SPI_SFR_PAGE;
  if (SPI0FCN1 & SPI0FCN1_TFRQ__BMASK)
  {
    ret = true;
  }
  SFRPAGE = savedPage;
  return ret;
}

// ----------------------------------------------------------------------------
// Read status of RFRQ
// ----------------------------------------------------------------------------
bool SPI0_isFifoRxReq(void)
{
  bool ret = false;
  uint8_t savedPage = SFRPAGE;
  SFRPAGE = SPI_SFR_PAGE;
  if (SPI0FCN1 & SPI0FCN1_RFRQ__BMASK)
  {
    ret = true;
  }
  SFRPAGE = savedPage;
  return ret;
}

// ----------------------------------------------------------------------------
// Get count of bytes in RX fifo
// ----------------------------------------------------------------------------
uint8_t SPI0_getRxFifoCount(void)
{
  uint8_t ret;
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);
  ret = SPI0FCT & SPI0FCT_RXCNT__FMASK;

  RESTORE_PAGE();
  return ret;
}

// ----------------------------------------------------------------------------
// Get count of bytes in TX fifo
// ----------------------------------------------------------------------------
uint8_t SPI0_getTxFifoCount(void)
{
  uint8_t ret;
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);
  ret = (SPI0FCT & SPI0FCT_TXCNT__FMASK) >> SPI0FCT_TXCNT__SHIFT;

  RESTORE_PAGE();
  return ret;
}

// ----------------------------------------------------------------------------
// Configure the FIFO operation
// ----------------------------------------------------------------------------
void SPI0_configureFifo(uint8_t txThreshold, uint8_t rxThreshold,
                        uint8_t rxTimeout)
{
  uint8_t fifoCtrl;
  DECL_PAGE;

  SET_PAGE(SPI_SFR_PAGE);

  // Set the TX and RX threshold fields
  fifoCtrl = SPI0FCN0;
  fifoCtrl &= ~(SPI0FCN0_TXTH__FMASK | SPI0FCN0_RXTH__FMASK);
  fifoCtrl |= ((txThreshold & 3) << SPI0FCN0_TXTH__SHIFT)
            | ((rxThreshold & 3) << SPI0FCN0_RXTH__SHIFT);

