charles8051/periphery/src/Periphery.Treehopper/firmware/Treehopper-EFM8/lib/efm8ub1/peripheralDrivers/src/spi_0.c
  // Only change the RX timeout if in slave mode
  if (!(SPI0CFG & SPI0CFG_MSTEN__BMASK))
  {
    // If non-zero then enable the rx timeout bit, and set the
    // timeout count
    if (rxTimeout)
    {
      fifoCtrl |= SPI0FCN1_RXTOE__ENABLED;
      SPI0CKR = rxTimeout;
    }

    // Else rxTimeout is 0, so disable the timeout bit
    else
    {
      fifoCtrl &= ~SPI0FCN1_RXTOE__ENABLED;
    }
  }
  SPI0FCN0 = fifoCtrl;
  RESTORE_PAGE();
}

#if EFM8PDL_SPI0_USE_BUFFER == 1

// flag to indicate that RX buffer should be used for buffered transfers
static bool useRx = false;

// flag to indicate that TX buffer should be used for buffered transfers
static bool useTx = false;

static uint8_t rxCountRemaining = 0;
static uint8_t txCountRemaining = 0;
static uint8_t bytesRemaining = 0;
static SI_VARIABLE_SEGMENT_POINTER(pTxBuf, uint8_t, EFM8PDL_SPI0_TX_SEGTYPE) = NULL;
static SI_VARIABLE_SEGMENT_POINTER(pRxBuf, uint8_t, EFM8PDL_SPI0_RX_SEGTYPE) = NULL;

// ----------------------------------------------------------------------------
// Set up an interrupt driven SPI transfer.
// ----------------------------------------------------------------------------
void
SPI0_transfer(SI_VARIABLE_SEGMENT_POINTER(pTxBuffer, uint8_t,
                                          EFM8PDL_SPI0_TX_SEGTYPE),
              SI_VARIABLE_SEGMENT_POINTER(pRxBuffer, uint8_t,
                                          EFM8PDL_SPI0_RX_SEGTYPE),
              SPI0_TransferDirection_t dir,
              uint8_t xferCount)
{
  DECL_PAGE;

  rxCountRemaining = xferCount;
  txCountRemaining = xferCount;
  bytesRemaining = xferCount;
  pTxBuf = pTxBuffer;
  pRxBuf = pRxBuffer;
  useRx = dir & SPI0_TRANSFER_RX;
  useTx = dir & SPI0_TRANSFER_TX;

  SET_PAGE(SPI_SFR_PAGE);

  // Check to see if run-time mode variables have been set up
  if (!initIsValid)
  {
    SPI0_internalInit();
  }

  // Flush the RX buffer in case something is in there
#if (EFM8PDL_SPI0_AUTO_PAGE == 1)
  {
    // if auto page is enabled then we dont need to change pages here
    SPI0FCN0 |= SPI0FCN0_RFLSH__FLUSH;
  }
#else
  {
    // if auto page is not enabled, then we need to change pages for
    // this section of code
    uint8_t savedPage = SFRPAGE;
    SFRPAGE = SPI_SFR_PAGE;
    SPI0FCN0 |= SPI0FCN0_RFLSH__FLUSH;
    SFRPAGE = savedPage;
  }
#endif

  // Clear all the interrupt flags
  SPI0CN0 &= ~0xF0;

  // Set up the interrupt to use the FIFO request levels instead of SPIF
  SPI0FCN1 &= ~SPI0FCN1_SPIFEN__BMASK;
  SPI0FCN0 |= SPI0FCN0_RFRQE__ENABLED;

  // assert NSS (if used)
  if (modeIsMaster && useNss)
  {
    SPI0CN0_NSSMD0 = 0;
  }

#if EFM8PDL_SPI0_USE_PIPELINE == 0
  // Write the first byte to get the transfer started
  if (SPI0CN0_TXNF && txCountRemaining)
  {
    // If user provided tx data, then use that
    if (useTx)
    {
      SPI0DAT = *pTxBuf;
      ++pTxBuf;
    }

    // Otherwise no tx data, so just stuff zeroes
    else
    {
      SPI0DAT = 0;
    }
    --txCountRemaining;
  }
#else
  // Stuff as many bytes as we can in the tx buffer to start.
  while (SPI0CN0_TXNF && txCountRemaining)
  {
    // If user provided tx data, then use that
    if (useTx)
    {
      SPI0DAT = *pTxBuf;
      ++pTxBuf;
    }

    // Otherwise no tx data, so just stuff zeroes
    else
    {
      SPI0DAT = 0;
    }
    --txCountRemaining;
  }
#endif

  RESTORE_PAGE();
  // At this point SPI should be running and the rest will be handled
  // in the interrupt service routine
}

// ----------------------------------------------------------------------------
// Stop a running SPI transfer.
// ----------------------------------------------------------------------------
void SPI0_abortTransfer(void)
{
  DECL_PAGE;

  // Resetting the counters will cause the ISR to ignore any remaining
  // SPI interrupts.
  txCountRemaining = 0;
  rxCountRemaining = 0;
  useTx = false;
  useRx = false;
  pTxBuf = NULL;
  pRxBuf = NULL;

  SET_PAGE(SPI_SFR_PAGE);

  // drop the chip select if used
  if (modeIsMaster && useNss)
  {
    SPI0CN0_NSSMD0 = 1;
  }

  // Flush buffers
  SPI0CN0_SPIEN = 0;
  SPI0FCN0 |= SPI0FCN0_RFLSH__FLUSH | SPI0FCN0_TFLSH__FLUSH;
  SPI0CN0_SPIEN = 1;

  RESTORE_PAGE();
}

// ----------------------------------------------------------------------------
// Get the number of bytes remaining in the transfer.  This will really
// be the number of RX bytes.
// ----------------------------------------------------------------------------
uint8_t SPI0_bytesRemaining(void)
{
  return bytesRemaining;
}

// ----------------------------------------------------------------------------
// Handler for interrupt driven SPI data transfers.
// ----------------------------------------------------------------------------
SI_INTERRUPT(SPI0_ISR, SPI0_IRQn)
{
  uint8_t intFlags;
  uint8_t fifoFlags;

  // This device has SFRPAGE autosave so we can change page here and
  // it will automatically be restored when interrupt exits
  SFRPAGE = SPI_SFR_PAGE;

  // Get the interrupt flags and then clear any that are pending
  intFlags = SPI0CN0 & 0xF0;
  SPI0CN0 = (SPI0CN0 & (~intFlags | 0x0F));
  // we are not using the normal interrupt flags for anything
  // in this ISR

  // Get the FIFO request flags
  fifoFlags = SPI0FCN1;

  // If either FIFO request flag is set, it means that there is
  // either more data to read or write, or both.  So just try
  // to read and write as much as we can at this time.
  if (fifoFlags & SPI0FCN1_RFRQ__BMASK)
  {
    // Read bytes as long as the read count is non-zero and there
    // are more bytes in the RX buffer
#if EFM8PDL_SPI0_USE_PIPELINE == 1
    while (rxCountRemaining && !(SPI0CFG & SPI0CFG_RXE__BMASK))
#else
    if (rxCountRemaining && !(SPI0CFG & SPI0CFG_RXE__BMASK))
#endif
    {
      // If the user provided an RX buffer then read a byte into that.
      if (useRx)
      {
        *pRxBuf = SPI0DAT;
        ++pRxBuf;
      }

      // Else, user does not care about RX data so do a dummy read.
      else
      {
        uint8_t dummy = SPI0DAT;
      }
      --rxCountRemaining;

      // If we get to zero remaining, it means that all the
      // bytes have been transferred.
      if (rxCountRemaining == 0)
      {
        // deassert NSS (if used)
        if (modeIsMaster && useNss)
        {
          SPI0CN0_NSSMD0 = 1;
        }
        // Tell user that the transfer is complete.
        SPI0_transferCompleteCb();
      }

      // If there are more RX bytes to receive, then remember the
      // current count to be used by _bytesRemaining()
      else
      {
        bytesRemaining = rxCountRemaining;
      }
    }

    // Write bytes if there are more TX bytes to send and the
    // TX buffer is not full
#if EFM8PDL_SPI0_USE_PIPELINE == 1
    while (txCountRemaining && SPI0CN0_TXNF)
#else
    if (txCountRemaining && SPI0CN0_TXNF)
#endif
    {
      // If user provided a TX buffer then write the next byte
      if (useTx)
      {
        SPI0DAT = *pTxBuf;
        ++pTxBuf;
      }

      // Otherwise user did not provide a buffer so just write a zero.
      else
      {
        SPI0DAT = 0;
      }
      --txCountRemaining;
    }
  }

#if EFM8PDL_SPI0_USE_ERR_CALLBACK == 1
  // Check for errors and notify user
  if (intFlags & (SPI0_MODF_IF | SPI0_RXOVR_IF))
  {
    // Note, the RXOVRN bit only happens in slave mode, and the MODF
    // bit is not very likely, so in master mode this block will
    // probably not ever be used.
    SPI0_transferErrorCb(intFlags & (SPI0_MODF_IF | SPI0_RXOVR_IF));
  }
#endif // EFM8PDL_SPI0_USE_ERR_CALLBACK
}

#endif // EFM8PDL_SPI0_USE_BUFFER

/** @} (end spi_0_group) */
